winter-JX/Smart-Water/stm32/蓄水池节点/Hardware/Motor.c
#include "stm32f10x.h"                  // Device header
#include "PWM.h"

/**
  * 函    数：直流电机初始化
  * 参    数：无
  * 返 回 值：无
  */
void Motor_Init(void)
{
	/*开启时钟*/
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);		//开启GPIOA的时钟
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4 | GPIO_Pin_5;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);						//将PA4和PA5引脚初始化为推挽输出	
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);		//开启GPIOA的时钟
	
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);						//将PA4和PA5引脚初始化为推挽输出	
	
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);		//开启GPIOA的时钟
	
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOC, &GPIO_InitStructure);						//将PA4和PA5引脚初始化为推挽输出	
	
	PWM_Init();													//初始化直流电机的底层PWM
}

/**
  * 函    数：直流电机设置速度
  * 参    数：Speed 要设置的速度，范围：-100~100
  * 返 回 值：无
  */
void Motor_SetSpeed(int8_t Speed)
{
	if (Speed >= 0)							//如果设置正转的速度值
	{
		GPIO_SetBits(GPIOA, GPIO_Pin_4);	//PA4置高电平
		GPIO_ResetBits(GPIOA, GPIO_Pin_5);	//PA5置低电平，设置方向为正转
		PWM_SetCompare3(Speed);				//PWM设置为速度值
	}
	else									//否则，即设置反转的速度值
	{
		GPIO_ResetBits(GPIOA, GPIO_Pin_4);	//PA4置低电平
		GPIO_SetBits(GPIOA, GPIO_Pin_5);	//PA5置高电平，设置方向为反转
		PWM_SetCompare3(-Speed);			//PWM设置为负的速度值，因为此时速度值为负数，而PWM只能给正数
	}
}

//-----------------------------------------------------------------------------
// 1:整体开关
// 11:1号吸水泵  12:2号吸水泵
void Motor1_ON()
{
		GPIO_SetBits(GPIOC, GPIO_Pin_6);	
		
}

void Motor1_OFF()
{
		GPIO_ResetBits(GPIOC, GPIO_Pin_6);
		
}

void Motor11_ON()
{
		GPIO_SetBits(GPIOB, GPIO_Pin_0);	
		
}

void Motor11_OFF()
{
		GPIO_ResetBits(GPIOB, GPIO_Pin_0);
		
}

void Motor12_ON()
{
		GPIO_SetBits(GPIOB, GPIO_Pin_1);	
		
}

void Motor12_OFF()
{
		GPIO_ResetBits(GPIOB, GPIO_Pin_1);	
		
}
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
//2号吸水泵

void Motor2_ON()
{
		GPIO_SetBits(GPIOC, GPIO_Pin_7);	
		
}

void Motor2_OFF()
{
		GPIO_ResetBits(GPIOC, GPIO_Pin_7);	//PA4置高电平
		
}

void Motor21_SetSpeed(int8_t Speed)
{
	PWM_SetCompare3(Speed);				//PWM设置为速度值
}

void Motor22_SetSpeed(int8_t Speed)
{
	PWM_SetCompare4(Speed);				//PWM设置为速度值
}